app/controllers/kittens_controller.rb

SELECT "kittens".* FROM "kittens"
---
  def index
    @kittens = Kitten.all

INSERT INTO "kittens" ("name", "color", "quirk") VALUES ($1, $2, $3) RETURNING "id"  [["name", ""], ["color", ""], ["quirk", ""]]
---
  def create
    @kitten = Kitten.new(kitten_params)
    respond_to do |format|
      if @kitten.save

SELECT  "kittens".* FROM "kittens" WHERE "kittens"."id" = $1 LIMIT $2  [["id", 26], ["LIMIT", 1]]
---
  def show
    @kitten = Kitten.find(params[:id])